Revit 2026 API

# FaceGetBoundingBox Method

---

Returns the UV bounding box of the face.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public BoundingBoxUV GetBoundingBox()
```
```vb
Public Function GetBoundingBox As BoundingBoxUV
```
```cpp
public:
BoundingBoxUV^ GetBoundingBox()
```
```fsharp
member GetBoundingBox : unit -> BoundingBoxUV
```

#### Return Value

BoundingBoxUVA BoundingBoxUV with the extents of the parameterization of the face.

#### Reference

Face Class

Autodesk.Revit.DB Namespace